{
	"modelTopology": {
		"class_name": "Model",
		"config": {
			"name": "model1",
			"layers": [
				{
					"name": "input1",
					"class_name": "InputLayer",
					"config": {
						"batch_input_shape": [null, 7, 7, 1],
						"dtype": "float32",
						"sparse": false,
						"name": "input1"
					},
					"inbound_nodes": []
				},
				{
					"name": "conv2d_Conv2D4",
					"class_name": "Conv2D",
					"config": {
						"filters": 8,
						"kernel_initializer": {
							"class_name": "VarianceScaling",
							"config": { "scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null }
						},
						"kernel_regularizer": null,
						"kernel_constraint": null,
						"kernel_size": [3, 3],
						"strides": [1, 1],
						"padding": "valid",
						"data_format": "channels_last",
						"dilation_rate": [1, 1],
						"activation": "relu",
						"use_bias": true,
						"bias_initializer": { "class_name": "Zeros", "config": {} },
						"bias_regularizer": null,
						"activity_regularizer": null,
						"bias_constraint": null,
						"name": "conv2d_Conv2D4",
						"trainable": true,
						"batch_input_shape": [null, 7, 7, 1],
						"dtype": "float32"
					},
					"inbound_nodes": [[["input1", 0, 0, {}]]]
				},
				{
					"name": "conv2d_Conv2D5",
					"class_name": "Conv2D",
					"config": {
						"filters": 16,
						"kernel_initializer": {
							"class_name": "VarianceScaling",
							"config": { "scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null }
						},
						"kernel_regularizer": null,
						"kernel_constraint": null,
						"kernel_size": [3, 3],
						"strides": [1, 1],
						"padding": "valid",
						"data_format": "channels_last",
						"dilation_rate": [1, 1],
						"activation": "relu",
						"use_bias": true,
						"bias_initializer": { "class_name": "Zeros", "config": {} },
						"bias_regularizer": null,
						"activity_regularizer": null,
						"bias_constraint": null,
						"name": "conv2d_Conv2D5",
						"trainable": true
					},
					"inbound_nodes": [[["conv2d_Conv2D4", 0, 0, {}]]]
				},
				{
					"name": "conv2d_Conv2D6",
					"class_name": "Conv2D",
					"config": {
						"filters": 32,
						"kernel_initializer": {
							"class_name": "VarianceScaling",
							"config": { "scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null }
						},
						"kernel_regularizer": null,
						"kernel_constraint": null,
						"kernel_size": [3, 3],
						"strides": [1, 1],
						"padding": "valid",
						"data_format": "channels_last",
						"dilation_rate": [1, 1],
						"activation": "relu",
						"use_bias": true,
						"bias_initializer": { "class_name": "Zeros", "config": {} },
						"bias_regularizer": null,
						"activity_regularizer": null,
						"bias_constraint": null,
						"name": "conv2d_Conv2D6",
						"trainable": true
					},
					"inbound_nodes": [[["conv2d_Conv2D5", 0, 0, {}]]]
				},
				{
					"name": "flatten_Flatten2",
					"class_name": "Flatten",
					"config": { "name": "flatten_Flatten2", "trainable": true },
					"inbound_nodes": [[["conv2d_Conv2D6", 0, 0, {}]]]
				},
				{
					"name": "dense_Dense3",
					"class_name": "Dense",
					"config": {
						"units": 16,
						"activation": "relu",
						"use_bias": true,
						"kernel_initializer": {
							"class_name": "VarianceScaling",
							"config": { "scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null }
						},
						"bias_initializer": { "class_name": "Zeros", "config": {} },
						"kernel_regularizer": null,
						"bias_regularizer": null,
						"activity_regularizer": null,
						"kernel_constraint": null,
						"bias_constraint": null,
						"name": "dense_Dense3",
						"trainable": true
					},
					"inbound_nodes": [[["flatten_Flatten2", 0, 0, {}]]]
				},
				{
					"name": "dense_Dense4",
					"class_name": "Dense",
					"config": {
						"units": 1,
						"activation": "linear",
						"use_bias": true,
						"kernel_initializer": {
							"class_name": "VarianceScaling",
							"config": { "scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null }
						},
						"bias_initializer": { "class_name": "Zeros", "config": {} },
						"kernel_regularizer": null,
						"bias_regularizer": null,
						"activity_regularizer": null,
						"kernel_constraint": null,
						"bias_constraint": null,
						"name": "dense_Dense4",
						"trainable": true
					},
					"inbound_nodes": [[["dense_Dense3", 0, 0, {}]]]
				}
			],
			"input_layers": [["input1", 0, 0]],
			"output_layers": [["dense_Dense4", 0, 0]]
		},
		"keras_version": "tfjs-layers 3.19.0",
		"backend": "tensor_flow.js"
	},
	"weightsManifest": [
		{
			"paths": ["weights.bin"],
			"weights": [
				{ "name": "conv2d_Conv2D4/kernel", "shape": [3, 3, 1, 8], "dtype": "float32" },
				{ "name": "conv2d_Conv2D4/bias", "shape": [8], "dtype": "float32" },
				{ "name": "conv2d_Conv2D5/kernel", "shape": [3, 3, 8, 16], "dtype": "float32" },
				{ "name": "conv2d_Conv2D5/bias", "shape": [16], "dtype": "float32" },
				{ "name": "conv2d_Conv2D6/kernel", "shape": [3, 3, 16, 32], "dtype": "float32" },
				{ "name": "conv2d_Conv2D6/bias", "shape": [32], "dtype": "float32" },
				{ "name": "dense_Dense3/kernel", "shape": [32, 16], "dtype": "float32" },
				{ "name": "dense_Dense3/bias", "shape": [16], "dtype": "float32" },
				{ "name": "dense_Dense4/kernel", "shape": [16, 1], "dtype": "float32" },
				{ "name": "dense_Dense4/bias", "shape": [1], "dtype": "float32" }
			]
		}
	],
	"format": "layers-model",
	"generatedBy": "TensorFlow.js tfjs-layers v3.19.0",
	"convertedBy": null
}
