{"modelTopology":{"class_name":"Model","config":{"name":"model2501","layers":[{"name":"input2501","class_name":"InputLayer","config":{"batch_input_shape":[null,17,17,75],"dtype":"float32","sparse":false,"name":"input2501"},"inbound_nodes":[]},{"name":"conv2d_Conv2D15004","class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15004","trainable":true,"batch_input_shape":[null,17,17,75],"dtype":"float32"},"inbound_nodes":[[["input2501",0,0,{}]]]},{"name":"conv2d_Conv2D15005","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15005","trainable":true},"inbound_nodes":[[["conv2d_Conv2D15004",0,0,{}]]]},{"name":"conv2d_Conv2D15006","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15006","trainable":true},"inbound_nodes":[[["conv2d_Conv2D15005",0,0,{}]]]},{"name":"flatten_Flatten5002","class_name":"Flatten","config":{"name":"flatten_Flatten5002","trainable":true},"inbound_nodes":[[["conv2d_Conv2D15006",0,0,{}]]]},{"name":"dense_Dense12503","class_name":"Dense","config":{"units":578,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12503","trainable":true},"inbound_nodes":[[["flatten_Flatten5002",0,0,{}]]]},{"name":"dense_Dense12504","class_name":"Dense","config":{"units":289,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12504","trainable":true},"inbound_nodes":[[["dense_Dense12503",0,0,{}]]]},{"name":"dense_Dense12505","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12505","trainable":true},"inbound_nodes":[[["dense_Dense12504",0,0,{}]]]}],"input_layers":[["input2501",0,0]],"output_layers":[["dense_Dense12505",0,0]]},"keras_version":"tfjs-layers 3.20.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D15004/kernel","shape":[3,3,75,8],"dtype":"float32"},{"name":"conv2d_Conv2D15004/bias","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D15005/kernel","shape":[3,3,8,16],"dtype":"float32"},{"name":"conv2d_Conv2D15005/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D15006/kernel","shape":[3,3,16,32],"dtype":"float32"},{"name":"conv2d_Conv2D15006/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense12503/kernel","shape":[3872,578],"dtype":"float32"},{"name":"dense_Dense12503/bias","shape":[578],"dtype":"float32"},{"name":"dense_Dense12504/kernel","shape":[578,289],"dtype":"float32"},{"name":"dense_Dense12504/bias","shape":[289],"dtype":"float32"},{"name":"dense_Dense12505/kernel","shape":[289,1],"dtype":"float32"},{"name":"dense_Dense12505/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.20.0","convertedBy":null}