{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_2501","layers":[{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15001","trainable":true,"batch_input_shape":[null,17,17,75],"dtype":"float32"}},{"class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15002","trainable":true}},{"class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15003","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten5001","trainable":true}},{"class_name":"Dense","config":{"units":867,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12501","trainable":true}},{"class_name":"Dense","config":{"units":289,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12502","trainable":true}}]},"keras_version":"tfjs-layers 3.20.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D15001/kernel","shape":[3,3,75,8],"dtype":"float32"},{"name":"conv2d_Conv2D15001/bias","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D15002/kernel","shape":[3,3,8,16],"dtype":"float32"},{"name":"conv2d_Conv2D15002/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D15003/kernel","shape":[3,3,16,32],"dtype":"float32"},{"name":"conv2d_Conv2D15003/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense12501/kernel","shape":[3872,867],"dtype":"float32"},{"name":"dense_Dense12501/bias","shape":[867],"dtype":"float32"},{"name":"dense_Dense12502/kernel","shape":[867,289],"dtype":"float32"},{"name":"dense_Dense12502/bias","shape":[289],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.20.0","convertedBy":null}